benchmark/old_outputs/single_thread/sieve_new/uni_32/2026-04-17T20:29:14-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1597743
number of failed transactions: 0 (0.000%)
latency average = 0.225 ms
initial connection time = 3.155 ms
tps = 8876.495180 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 50.0% of total)
 - 799144 transactions (50.0% of total)
 - number of transactions actually processed: 799144 (tps = 4439.761504)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.095 ms
 - latency stddev = 0.018 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 50.0% of total)
 - 798599 transactions (50.0% of total)
 - number of transactions actually processed: 798599 (tps = 4436.733676)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.355 ms
 - latency stddev = 0.476 ms
ratio: .6646213241453057